{"class_name": "Model", "config": {"name": "model_19", "layers": [{"name": "input_91", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 1], "dtype": "float32", "sparse": false, "name": "input_91"}, "inbound_nodes": []}, {"name": "lstm_814", "class_name": "LSTM", "config": {"name": "lstm_814", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["input_91", 0, 0, {}]]]}, {"name": "dense_431", "class_name": "Dense", "config": {"name": "dense_431", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_814", 0, 0, {}]]]}, {"name": "reshape_277", "class_name": "Reshape", "config": {"name": "reshape_277", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_431", 0, 0, {}]]]}, {"name": "concatenate_685", "class_name": "Concatenate", "config": {"name": "concatenate_685", "trainable": true, "axis": 1}, "inbound_nodes": [[["input_91", 0, 0, {}], ["reshape_277", 0, 0, {}]]]}, {"name": "lstm_815", "class_name": "LSTM", "config": {"name": "lstm_815", "trainable": true, "batch_input_shape": [null, 61, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_685", 0, 0, {}]]]}, {"name": "dense_432", "class_name": "Dense", "config": {"name": "dense_432", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_815", 0, 0, {}]]]}, {"name": "reshape_278", "class_name": "Reshape", "config": {"name": "reshape_278", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_432", 0, 0, {}]]]}, {"name": "concatenate_687", "class_name": "Concatenate", "config": {"name": "concatenate_687", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_685", 0, 0, {}], ["reshape_278", 0, 0, {}]]]}, {"name": "lstm_816", "class_name": "LSTM", "config": {"name": "lstm_816", "trainable": true, "batch_input_shape": [null, 62, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_687", 0, 0, {}]]]}, {"name": "dense_433", "class_name": "Dense", "config": {"name": "dense_433", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_816", 0, 0, {}]]]}, {"name": "reshape_279", "class_name": "Reshape", "config": {"name": "reshape_279", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_433", 0, 0, {}]]]}, {"name": "concatenate_689", "class_name": "Concatenate", "config": {"name": "concatenate_689", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_687", 0, 0, {}], ["reshape_279", 0, 0, {}]]]}, {"name": "lstm_817", "class_name": "LSTM", "config": {"name": "lstm_817", "trainable": true, "batch_input_shape": [null, 63, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_689", 0, 0, {}]]]}, {"name": "dense_434", "class_name": "Dense", "config": {"name": "dense_434", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_817", 0, 0, {}]]]}, {"name": "reshape_280", "class_name": "Reshape", "config": {"name": "reshape_280", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_434", 0, 0, {}]]]}, {"name": "concatenate_691", "class_name": "Concatenate", "config": {"name": "concatenate_691", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_689", 0, 0, {}], ["reshape_280", 0, 0, {}]]]}, {"name": "lstm_818", "class_name": "LSTM", "config": {"name": "lstm_818", "trainable": true, "batch_input_shape": [null, 64, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_691", 0, 0, {}]]]}, {"name": "dense_435", "class_name": "Dense", "config": {"name": "dense_435", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_818", 0, 0, {}]]]}, {"name": "reshape_281", "class_name": "Reshape", "config": {"name": "reshape_281", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_435", 0, 0, {}]]]}, {"name": "concatenate_693", "class_name": "Concatenate", "config": {"name": "concatenate_693", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_691", 0, 0, {}], ["reshape_281", 0, 0, {}]]]}, {"name": "lstm_819", "class_name": "LSTM", "config": {"name": "lstm_819", "trainable": true, "batch_input_shape": [null, 65, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_693", 0, 0, {}]]]}, {"name": "dense_436", "class_name": "Dense", "config": {"name": "dense_436", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_819", 0, 0, {}]]]}, {"name": "reshape_282", "class_name": "Reshape", "config": {"name": "reshape_282", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_436", 0, 0, {}]]]}, {"name": "concatenate_695", "class_name": "Concatenate", "config": {"name": "concatenate_695", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_693", 0, 0, {}], ["reshape_282", 0, 0, {}]]]}, {"name": "lstm_820", "class_name": "LSTM", "config": {"name": "lstm_820", "trainable": true, "batch_input_shape": [null, 66, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_695", 0, 0, {}]]]}, {"name": "dense_437", "class_name": "Dense", "config": {"name": "dense_437", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_820", 0, 0, {}]]]}, {"name": "reshape_283", "class_name": "Reshape", "config": {"name": "reshape_283", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_437", 0, 0, {}]]]}, {"name": "concatenate_697", "class_name": "Concatenate", "config": {"name": "concatenate_697", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_695", 0, 0, {}], ["reshape_283", 0, 0, {}]]]}, {"name": "lstm_821", "class_name": "LSTM", "config": {"name": "lstm_821", "trainable": true, "batch_input_shape": [null, 67, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_697", 0, 0, {}]]]}, {"name": "dense_438", "class_name": "Dense", "config": {"name": "dense_438", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_821", 0, 0, {}]]]}, {"name": "reshape_284", "class_name": "Reshape", "config": {"name": "reshape_284", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_438", 0, 0, {}]]]}, {"name": "concatenate_699", "class_name": "Concatenate", "config": {"name": "concatenate_699", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_697", 0, 0, {}], ["reshape_284", 0, 0, {}]]]}, {"name": "lstm_822", "class_name": "LSTM", "config": {"name": "lstm_822", "trainable": true, "batch_input_shape": [null, 68, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_699", 0, 0, {}]]]}, {"name": "dense_439", "class_name": "Dense", "config": {"name": "dense_439", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_822", 0, 0, {}]]]}, {"name": "reshape_285", "class_name": "Reshape", "config": {"name": "reshape_285", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_439", 0, 0, {}]]]}, {"name": "concatenate_701", "class_name": "Concatenate", "config": {"name": "concatenate_701", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_699", 0, 0, {}], ["reshape_285", 0, 0, {}]]]}, {"name": "lstm_823", "class_name": "LSTM", "config": {"name": "lstm_823", "trainable": true, "batch_input_shape": [null, 69, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_701", 0, 0, {}]]]}, {"name": "concatenate_686", "class_name": "Concatenate", "config": {"name": "concatenate_686", "trainable": true, "axis": 1}, "inbound_nodes": [[["reshape_277", 0, 0, {}], ["reshape_278", 0, 0, {}]]]}, {"name": "dense_440", "class_name": "Dense", "config": {"name": "dense_440", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_823", 0, 0, {}]]]}, {"name": "concatenate_688", "class_name": "Concatenate", "config": {"name": "concatenate_688", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_686", 0, 0, {}], ["reshape_279", 0, 0, {}]]]}, {"name": "reshape_286", "class_name": "Reshape", "config": {"name": "reshape_286", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_440", 0, 0, {}]]]}, {"name": "concatenate_690", "class_name": "Concatenate", "config": {"name": "concatenate_690", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_688", 0, 0, {}], ["reshape_280", 0, 0, {}]]]}, {"name": "concatenate_703", "class_name": "Concatenate", "config": {"name": "concatenate_703", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_701", 0, 0, {}], ["reshape_286", 0, 0, {}]]]}, {"name": "concatenate_692", "class_name": "Concatenate", "config": {"name": "concatenate_692", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_690", 0, 0, {}], ["reshape_281", 0, 0, {}]]]}, {"name": "lstm_824", "class_name": "LSTM", "config": {"name": "lstm_824", "trainable": true, "batch_input_shape": [null, 70, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_703", 0, 0, {}]]]}, {"name": "concatenate_694", "class_name": "Concatenate", "config": {"name": "concatenate_694", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_692", 0, 0, {}], ["reshape_282", 0, 0, {}]]]}, {"name": "dense_441", "class_name": "Dense", "config": {"name": "dense_441", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_824", 0, 0, {}]]]}, {"name": "concatenate_696", "class_name": "Concatenate", "config": {"name": "concatenate_696", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_694", 0, 0, {}], ["reshape_283", 0, 0, {}]]]}, {"name": "reshape_287", "class_name": "Reshape", "config": {"name": "reshape_287", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_441", 0, 0, {}]]]}, {"name": "concatenate_698", "class_name": "Concatenate", "config": {"name": "concatenate_698", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_696", 0, 0, {}], ["reshape_284", 0, 0, {}]]]}, {"name": "concatenate_705", "class_name": "Concatenate", "config": {"name": "concatenate_705", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_703", 0, 0, {}], ["reshape_287", 0, 0, {}]]]}, {"name": "concatenate_700", "class_name": "Concatenate", "config": {"name": "concatenate_700", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_698", 0, 0, {}], ["reshape_285", 0, 0, {}]]]}, {"name": "lstm_825", "class_name": "LSTM", "config": {"name": "lstm_825", "trainable": true, "batch_input_shape": [null, 71, 1], "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 30, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_705", 0, 0, {}]]]}, {"name": "concatenate_702", "class_name": "Concatenate", "config": {"name": "concatenate_702", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_700", 0, 0, {}], ["reshape_286", 0, 0, {}]]]}, {"name": "dense_442", "class_name": "Dense", "config": {"name": "dense_442", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lstm_825", 0, 0, {}]]]}, {"name": "concatenate_704", "class_name": "Concatenate", "config": {"name": "concatenate_704", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_702", 0, 0, {}], ["reshape_287", 0, 0, {}]]]}, {"name": "reshape_288", "class_name": "Reshape", "config": {"name": "reshape_288", "trainable": true, "target_shape": [1, 1]}, "inbound_nodes": [[["dense_442", 0, 0, {}]]]}, {"name": "concatenate_706", "class_name": "Concatenate", "config": {"name": "concatenate_706", "trainable": true, "axis": 1}, "inbound_nodes": [[["concatenate_704", 0, 0, {}], ["reshape_288", 0, 0, {}]]]}], "input_layers": [["input_91", 0, 0]], "output_layers": [["concatenate_706", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}